MICROSIDE-TECHNOLOGY/NanoCoreX/megaavr/boards.txt
menu.clock=Clock
menu.BOD=BOD
menu.eeprom=EEPROM
menu.pinout=Pinout
menu.resetpin=Reset pin
menu.bootloader=Bootloader

########################
#### Microside NANO-X ####
########################

# General
msidenanox.name=Microside NANO-X
msidenanox.upload.tool=avrdude
msidenanox.upload.maximum_data_size=6144
msidenanox.upload.speed=115200
msidenanox.bootloader.tool=avrdude
msidenanox.build.core=coreX-corefiles
msidenanox.build.board=AVR_ATmega4808
msidenanox.build.mcu=atmega4808
msidenanox.build.extra_flags={build.oscillator}

# Fuses we don't need to modify in the tools menu
msidenanox.bootloader.WDTCFG=0x00
msidenanox.bootloader.TCD0CFG=0x00
msidenanox.bootloader.SYSCFG1=0x06
msidenanox.bootloader.APPEND=0x00
msidenanox.bootloader.LOCKBIT=0xC5

# Pinouts
msidenanox.menu.pinout.nanox_microside=Microside NANO-X
msidenanox.menu.pinout.nanox_microside.build.variant=nanox

# EEPROM
msidenanox.menu.eeprom.keep=EEPROM retained
msidenanox.menu.eeprom.keep.bootloader.eesave_bit=1
msidenanox.menu.eeprom.erase=EEPROM not retained
msidenanox.menu.eeprom.erase.bootloader.eesave_bit=0

# Reset pin
msidenanox.menu.resetpin.reset=Reset
msidenanox.menu.resetpin.reset.bootloader.SYSCFG0=0b1100100{bootloader.eesave_bit}
msidenanox.menu.resetpin.gpio=GPIO
msidenanox.menu.resetpin.gpio.bootloader.SYSCFG0=0b1100000{bootloader.eesave_bit}

# Brown out detection
msidenanox.menu.BOD.2v6=BOD 2.6V
msidenanox.menu.BOD.2v6.bootloader.BODCFG=0x54
msidenanox.menu.BOD.4v3=BOD 4.3V
msidenanox.menu.BOD.4v3.bootloader.BODCFG=0xF4
msidenanox.menu.BOD.4v0=BOD 4.0V
msidenanox.menu.BOD.4v0.bootloader.BODCFG=0xD4
msidenanox.menu.BOD.3v7=BOD 3.7V
msidenanox.menu.BOD.3v7.bootloader.BODCFG=0xB4
msidenanox.menu.BOD.3v3=BOD 3.3V
msidenanox.menu.BOD.3v3.bootloader.BODCFG=0x94
msidenanox.menu.BOD.2v9=BOD 2.9V
msidenanox.menu.BOD.2v9.bootloader.BODCFG=0x74
msidenanox.menu.BOD.2v1=BOD 2.1V
msidenanox.menu.BOD.2v1.bootloader.BODCFG=0x34
msidenanox.menu.BOD.1v8=BOD 1.8V
msidenanox.menu.BOD.1v8.bootloader.BODCFG=0x14
msidenanox.menu.BOD.disabled=BOD disabled
msidenanox.menu.BOD.disabled.bootloader.BODCFG=0x00

# Clock
msidenanox.menu.clock.internal_20MHz=Internal 20 MHz
msidenanox.menu.clock.internal_20MHz.upload.speed=115200
msidenanox.menu.clock.internal_20MHz.bootloader.OSCCFG=0x02
msidenanox.menu.clock.internal_20MHz.build.oscillator=
msidenanox.menu.clock.internal_20MHz.build.f_cpu=20000000L

# Bootloader
msidenanox.menu.bootloader.uart0_default=Optiboot (UART0 default pins)
msidenanox.menu.bootloader.uart0_default.upload.maximum_size=48640
msidenanox.menu.bootloader.uart0_default.upload.protocol=arduino
msidenanox.menu.bootloader.uart0_default.upload.port=UART0_DEF
msidenanox.menu.bootloader.uart0_default.upload.extra_params=
msidenanox.menu.bootloader.uart0_default.build.text_section_start=.text=0x200
msidenanox.menu.bootloader.uart0_default.build.export_merged_output=true
msidenanox.menu.bootloader.uart0_default.bootloader.file=optiboot/bootloaders/mega0/{upload.speed}/Optiboot_mega0_{upload.port}_{upload.speed}_A7.hex
msidenanox.menu.bootloader.uart0_default.bootloader.BOOTEND=0x02
msidenanox.menu.bootloader.uart0_default.bootloader.SYSCFG0=0b1100100{bootloader.eesave_bit}